renesas/rx-driver-package/source/r_riic_rx/r_riic_rx_vx.xx/r_riic_rx/src/targets/rx66n/r_riic_rx66n.c
/***********************************************************************************************************************
 * Function Name: riic_mcu_int_icier_setting
 * Description  : Time out interrupt enable bit setting.
 * Arguments    : uint8_t channel
 *              : uint8_t New_icier       ; New ICIER value
 * Return Value : None
 **********************************************************************************************************************/
void riic_mcu_int_icier_setting (uint8_t channel, uint8_t New_icier)
{
    volatile uint8_t uctmp = 0x00;

    /* Channel number? */
    switch (channel)
    {
    #if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */
        #if (1U == RIIC_CFG_CH0_TMO_ENABLE)
            RIIC0.ICIER.BYTE = (New_icier | RIIC_ICIER_TMO);
            uctmp = RIIC0.ICIER.BYTE; /* Reads ICIER. */
        #else
            RIIC0.ICIER.BYTE = New_icier;
            uctmp = RIIC0.ICIER.BYTE; /* Reads ICIER. */
        #endif
        break;
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
        case 0x01 : /* Channel 1 */
        #if (1U == RIIC_CFG_CH1_TMO_ENABLE)
            RIIC1.ICIER.BYTE = (New_icier | RIIC_ICIER_TMO);
            uctmp = RIIC1.ICIER.BYTE; /* Reads ICIER. */
        #else
            RIIC1.ICIER.BYTE = New_icier;
            uctmp = RIIC1.ICIER.BYTE; /* Reads ICIER. */
        #endif
        break;
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
        case 0x02: /* Channel 2 */
        #if (1U == RIIC_CFG_CH2_TMO_ENABLE)
            RIIC2.ICIER.BYTE = (New_icier | RIIC_ICIER_TMO);
            uctmp = RIIC2.ICIER.BYTE; /* Reads ICIER. */
        #else
            RIIC2.ICIER.BYTE = New_icier;
            uctmp = RIIC2.ICIER.BYTE; /* Reads ICIER. */
        #endif
        break;
    #endif

        default :

            /* Please add a channel as needed. */
        break;
    }
} /* End of function riic_mcu_int_icier_setting() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_int_enable
 * Description  : Clears interrupt request register.
 *              : Enables interrupt.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riic_mcu_int_enable (uint8_t channel)
{
    #if ((1U == RIIC_CFG_CH0_INCLUDED) || (1U == RIIC_CFG_CH1_INCLUDED) || (1U == RIIC_CFG_CH2_INCLUDED))
    volatile uint8_t uctmp = 0x00;
    volatile bsp_int_ctrl_t group_priority;
    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
    #endif
    group_priority.ipl = 0x00000000;

        #if (1U == RIIC_CFG_CH0_INCLUDED)
    if (group_priority.ipl < RIIC_IPR_CH0_EEI_SET)
    {
        group_priority.ipl = (uint32_t) RIIC_IPR_CH0_EEI_SET;
    }
    if (group_priority.ipl < RIIC_IPR_CH0_TEI_SET)
    {
        group_priority.ipl = (uint32_t) RIIC_IPR_CH0_TEI_SET;
    }
        #endif

        #if (1U == RIIC_CFG_CH1_INCLUDED)
    if (group_priority.ipl < RIIC_IPR_CH1_EEI_SET)
    {
        group_priority.ipl = (uint32_t) RIIC_IPR_CH1_EEI_SET;
    }
    if (group_priority.ipl < RIIC_IPR_CH1_TEI_SET)
    {
        group_priority.ipl = (uint32_t) RIIC_IPR_CH1_TEI_SET;
    }
        #endif

        #if (1U == RIIC_CFG_CH2_INCLUDED)
    if(group_priority.ipl < RIIC_IPR_CH2_EEI_SET)
    {
        group_priority.ipl = (uint32_t)RIIC_IPR_CH2_EEI_SET;
    }
    if(group_priority.ipl < RIIC_IPR_CH2_TEI_SET)
    {
        group_priority.ipl = (uint32_t)RIIC_IPR_CH2_TEI_SET;
    }
        #endif

    R_BSP_InterruptControl(BSP_INT_SRC_BL1_RIIC0_TEI0, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
    #endif

    /* Channel number? */
    switch (channel)
    {
    #if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */

            /* Enables interrupt. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIIC_IER_EEI0_GPBL1 = RIIC_IER_ENABLE; /* Enables EEI0 groupBL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            RIIC_IER_RXI0 = RIIC_IER_ENABLE; /* Enables RXI0 interrupt request enable register. */
            RIIC_IER_TXI0 = RIIC_IER_ENABLE; /* Enables TXI0 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIIC_IER_TEI0_GPBL1 = RIIC_IER_ENABLE; /* Enables TEI0 groupBL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif

            /* Sets interrupt source priority. */
            RIIC_IPR_RXI0 = RIIC_IPR_CH0_RXI_SET; /* Sets RXI0 interrupt source priority register. */
            RIIC_IPR_TXI0 = RIIC_IPR_CH0_TXI_SET; /* Sets TXI0 interrupt source priority register. */
            uctmp = RIIC_IPR_TXI0; /* Reads IPR. */
        break;
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
        case 0x01 : /* Channel 1 */

            /* Enables interrupt. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIIC_IER_EEI1_GPBL1 = RIIC_IER_ENABLE; /* Enables EEI1 groupBL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            RIIC_IER_RXI1 = RIIC_IER_ENABLE; /* Enables RXI1 interrupt request enable register. */
            RIIC_IER_TXI1 = RIIC_IER_ENABLE; /* Enables TXI1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            RIIC_IER_TEI1_GPBL1 = RIIC_IER_ENABLE; /* Enables TEI1 groupBL1 interrupt request enable register. */
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif

            /* Sets interrupt source priority. */
            RIIC_IPR_RXI1 = RIIC_IPR_CH1_RXI_SET; /* Sets RXI1 interrupt source priority register. */
            RIIC_IPR_TXI1 = RIIC_IPR_CH1_TXI_SET; /* Sets TXI1 interrupt source priority register. */
            uctmp = RIIC_IPR_TXI1; /* Reads IPR. */
        break;
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
        case 0x02: /* Channel 2 */

